txt = '''**История как наука**

* История — интегративная гуманитарная наука, изучающая прошлое человечества с помощью исторических источников и пытающаяся выявить объективные закономерности развития общества.
* Основной объект исторической науки — исторический источник (вещественный объект, который содержит историческую информацию).
* Предмет изучения исторической науки — закономерности развития исторического прошлого человечества.
* Цель истории — познание исторической истины.
* Все документы делятся на «источники» («первичные») и «литературу» («вторичные источники»).

**Методология истории**

 * Методология включает совокупность принципов, методов и приёмов для изучения, анализа и интерпретации её прошлого.
* Исследование и критика исторических источников помогают оценить их достоверность и значимость.
* Интерпретация и понимание исторических текстов позволяют правильно трактовать исторические данные.
* Историография изучает историю исторической науки в России.

**Тенденции и закономерности исторического развития**

* Исторические тенденции развития — это направленные изменения состояния объекта в будущем, обусловленные его состоянием в прошлом и настоящем.
* Исторические закономерности носят вероятностный характер и связаны с деятельностью человека.
* Развитие России можно охарактеризовать через несколько ключевых тенденций и закономерностей: централизация власти, территориальное расширение, модернизация и реформы, культурные трансформации, революционные изменения, геополитическая роль.

**Факторы и уроки истории**

Факторы истории — это различные факторы и условия, которые оказывают влияние на ход и развитие исторических событий и процессов: социальные, политические, экономические, культурные, географические, технологические, внешние.
Историческая наука имеет дело с самым сложным предметом исследования — человеком и человеческими отношениями. Историю двигают хорошо организованное и идейно оформленное меньшинство во главе с лидерами, но при этом опирающееся на большие массы людей, чьи интересы они защищают и реализуют.

**Периодизация исторического процесса**

Развёрнутая периодизация:
1. Древняя Русь (IX — начало XIII века).
2. Феодальная раздробленность (XIII — XV века).
3. Московское княжество и царство (XIV — XVII века).
4. Российская империя (XVIII — начало XX века).
5. Советский период (1917–1991). **Принципы понимания истории**

1. Историзм — рассмотрение исторических фактов и событий в соответствии с конкретной исторической обстановкой, изучение явлений в развитии.
2. Принцип объективности — непредвзятое рассмотрение каждого события и факта во всей многогранности и противоречивости.
3. Принцип социального подхода (партийности) — учёт социальных, классовых, групповых, партийных интересов различных слоёв населения и субъективных интересов отдельных личностей при рассмотрении историко-экономических процессов.
4. Принцип многовариантности и альтернативности — определение степени вероятности осуществления того или иного события на основе неиспользованных возможностей исторического процесса для извлечения уроков на будущее.

**Формы исторического сознания и черты исторического мышления современности**

Историческое сознание — совокупность идей, взглядов, представлений, чувств и настроений, отражающих восприятие и оценку прошлого во всём его многообразии. 
Формы исторического сознания:
* Обыденное историческое сознание складывается на основе жизненного опыта людей. Оно субъективно, эмоционально и бессистемно.
* Теоретическое историческое сознание формируется специалистами, на основе теоретического осмысления прошлого, научного мировоззрения. Оно максимально объективно, системно и осмысливает исторический процесс в динамике, во взаимосвязи событий и времени.
Современное историческое мышление обладает следующими чертами:
* Сложилось на основе междисциплинарного синтеза концепций и понятий материалистического понимания истории, неопозитивизма, теоретической экономики, макросоциальной теории, политологии, культурной антропологии, психологии, лингвистики.
* Отправной точкой в осмыслении исторического прошлого являются ценности современности: демократия и свободы личности, ценность человеческой жизни; солидарность в обществе и гармония между частным и общим.

**Познавательные траектории истории — линейные и нелинейные**

Линейные теории исторического развития представляют идею прогресса и связаны с эпохой Просвещения. Они предполагают последовательное движение через различные стадии развития, характерные для всех народов. Примерами являются:

* Теория прогресса Вико и Конта — развитие общества воспринимается как движение к более высоким формам организации на основе увеличения производительных сил и развития культуры.
* Марксистская концепция общественно-экономических формаций — общество проходит через три основных этапа: первобытнообщинный, рабовладельческий, феодальный и капиталистический, что предполагает постепенное улучшение условий труда и уменьшение эксплуатации.
Нелинейные теории исторического развития утверждают, что исторические процессы характеризуются неоднородностью и частыми изменениями направления развития. Примеры включают:

* Волновые теории истории (Чижевский, Кондратьев) — история проходит через циклические фазы экономического и социального развития, связанные с изменениями в экономике и социуме.
* Критика прогрессивного взгляда (Руссо, Ницше) — Ф. Ницше и Ж. Руссо высказывались против идеи неограниченного прогресса, критикуя социальное неравенство и эгоизм, присущий современной буржуазной цивилизации.

**Формационный и цивилизационный взгляды на историю**

К цивилизационной школе относят Н. Данилевского, О. Шпенглера, А. Тойнби и др. Циклические теории утверждают, что в жизни общества имеют место периоды подъёма, спада, вплоть до конца. История — это круговорот локальных цивилизаций. «Цивилизационщики» считали, что нет единой всеобщей истории, а вся человеческая история разделяется на многовариантную историю отдельных локальных цивилизаций — больших и уникальных человеческих культур.

Недостатки цивилизационного подхода: отсутствие чёткого единого критерия выделения цивилизаций; отсутствие единой методологии, единого определения категориального аппарата, в т. ч. нет единого определения центрального термина концепции — «цивилизация»; история не рассматривается как единый закономерный процесс. Основное внимание уделяется вопросам культуры, духовного развития, а социально-экономическому развитию уделяется мало внимания.

Формационный подход основывается на том, что каждое общество линейно проходит в своём развитии определённые стадии (общественно-экономические формации), которые сменяют друг друга через революцию. Главный критерий — способ производства. Способ производства — это единство определённого уровня производительных сил и обусловленных им производственных отношений. В классическом (советском) понимании формационной теории принято выделять пять стадий развития общества: первобытно-общинное, рабовладельческое, феодальное, капиталистическое, коммунистическое. Переход от одной формации к другой происходит через социальную революцию.

Недостатками формационного подхода является абсолютизация т. н. «пятичленки», при том, что не все народы и страны проходили через все эти стадии; абсолютизация необходимости революционного пути. Кроме того, основное внимание уделяется экономическим факторам, а роль личности, культурная и духовная жизнь выпадают из поля зрения, рассматриваются упрощённо.

**Глобально-стадиальная и мир-системная концепции истории — общее и особенное**

Глобально-стадиальная концепция (Ю. Семёнов) развивает линейно-стадиальную формационную теорию Маркса, заменяя понятие общественных формаций на «социор» — социально-исторический организм. Линейность развития — по мнению Семёнова, переход между различными «социорами» происходит линейно в центре мировой социорной системы, в то время как на периферии развитие может быть нелинейным с возможностью перепрыгивания стадий развития. Пример: азиатский способ производства рассматривается как «политарный», с универсальной коллективной собственностью на средства производства.

Мир-системная концепция (И. Валлерстайн): основные принципы исходят из появления в XVI веке капиталистической мировой системы, объединяющей в единое целое всё мировое пространство. Иерархия и зависимость: Мир-система иерархична, с центром (1 миром), полупериферией (2 миром) и периферией (3 миром). Лидером всегда выступает наиболее мощная капиталистическая страна (например, Голландия, Великобритания, США). Эксплуатация и перекачка ресурсов: центр эксплуатирует ресурсы и труд периферийных стран через систему перекачки капитала и ресурсов. Общие черты: концепции подчёркивают разницу в развитии между центром и периферией; акцентируют внимание на социально-экономических аспектах глобального развития; представляют системный подход к анализу мировой истории.

**Синергетическая парадигма истории**

Синергетика — наука о самоорганизации и закономерностях эволюции сложных систем в физическом мире и социуме. Основная идея синергетики возникла в результате наблюдения над сложными природными системами. Суть её заключается в том, что их развитие проходит длительные периоды аттракторов (стабильных состояний), которые сменяются кратковременными периодами бифуркации (хаотичного состояния). В рамках бифуркации происходит переход к следующему вектору развития системы, при этом его выбор не является предопределённым, а зависит от случайного характера изменений, которые переживает система в точке бифуркации.

'''
